Tekla Open API Reference for Tekla Structures 2025
CustomPartInputTypeAttribute Class
 The CustomPartInputTypeAttribute class is used for defining the input type. Based on the type the system will then ask for the correct number of input points in the creation. The attribute is initialized from the custom attribute [CustomPartInputType(CustomPartBase.CustomPartInputType.INPUT_1_POINT)] in the custom part source code.
Inheritance Hierarchy
System.Object
 System.Attribute
 Tekla.Structures.Plugins.CustomPartInputTypeAttribute
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class CustomPartInputTypeAttribute : Attribute
Public NotInheritable Class CustomPartInputTypeAttribute
	Inherits Attribute
The CustomPartInputTypeAttribute type exposes the following members.
Constructors
Name | Description
CustomPartInputTypeAttribute(Int32)
 The custom attribute uses this to store the input type to the system. This is not to be used by itself.
CustomPartInputTypeAttribute(CustomPartBase.CustomPartInputType)
 The custom attribute uses this to store the input type to the system. This is not to be used by itself.
Top
Properties
Name | Description
Type
 The custom attribute uses this to store the input type to the system. This is not to be used by itself.
Top
See Also
Reference
Tekla.Structures.Plugins Namespace